Pandas

Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

Series:
1. A Series is a one-dimensional labeled array capable of holding data of various types (integers, strings, Python objects, etc.).

2. It can be thought of as a single column in a spreadsheet or a dictionary in Python.

3. Each element in a Series has an associated index, which facilitates data retrieval and manipulation.

DataFarme

A two -dimensional data structure  with column of pontentially different type of data - DataFrame

In [2]:
pip install pandas

Requirement already satisfied: pandas in d:\data science\python\venv\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.22.4 in d:\data science\python\venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\data science\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\data science\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\data science\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\data science\python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
## Series 
## A Pandas is a one dimensional array -like object that can hold any data type. It is similarto

import pandas as pd 
data=[1,2,3,4,5]
series=pd.Series(data)

print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data=[10,20,30]
index=['a','b','c']
series=pd.Series(data,index=index)
print(series)

a    10
b    20
c    30
dtype: int64

In [5]:
data=pd.Series([10,20,30],index=['a','b','c'])
data

a    10
b    20
c    30
dtype: int64

DataFrame

Creating DataFrame

In [6]:
# Dataframe
# create data From a dictionay of list 

data={
    'Name':['Avnish','Ayush','Rohit'],
    'Age':[20,19,21],
    "City":['lakhimpur','roorkee','Ballia']
}

# creating a dataframe object

df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Avnish   20  lakhimpur
1   Ayush   19    roorkee
2   Rohit   21     Ballia
<class 'pandas.core.frame.DataFrame'>

In [7]:
# create a Data frame From a List of Dictionaries  
data=[
    {'Name':"Avnish",'Age':20,'City':'Kanpur'},
        {'Name':"Rohit",'Age':20,'City':'Ballia'},
            {'Name':"Ayush",'Age':19,'City':'Kanpur'},


]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age    City
0  Avnish   20  Kanpur
1   Rohit   20  Ballia
2   Ayush   19  Kanpur
<class 'pandas.core.frame.DataFrame'>

In [8]:
 #Accessing  Data From DAtaFrame
    
data=[    
    {'Name':"Avnish",'Age':20,'City':'Kanpur'},
        {'Name':"Rohit",'Age':20,'City':'Ballia'},
            {'Name':"Ayush",'Age':19,'City':'Kanpur'},


]
 
df=pd.DataFrame(data)

print(df)

     Name  Age    City
0  Avnish   20  Kanpur
1   Rohit   20  Ballia
2   Ayush   19  Kanpur

Selecting Rows and Columns using loc and iloc :

.loc: This is used for label-based indexing. You can select data by row and column labels.

In [40]:
# Select rows and columns using label-based indexing

df.loc[df['Age']==20,['Name','City']]

    Name    City
2  Ayush  Kanpur

In [42]:
df.loc[df['Name']=='Avnish',['Age','City']]

   Age    City
0   21  Kanpur

.iloc: This is used for position-based indexing. You can select data by row and column numbers.

In [ ]:
# Select rows and columns using integer-based indexing

df.iloc[[0],[1]]

   Age
0   20

In [12]:
df

     Name  Age    City
0  Avnish   20  Kanpur
1   Rohit   20  Ballia
2   Ayush   19  Kanpur

In [13]:
# Acessing a specified element 

df.at[2,'Name']    ### row and column put

'Ayush'

In [14]:
# Acessing a specified element using iat

df.iat[2,0]

'Ayush'

In [15]:
## Data Manipulation with Dataframe
df

     Name  Age    City
0  Avnish   20  Kanpur
1   Rohit   20  Ballia
2   Ayush   19  Kanpur

In [16]:
# Adding a column 
df['Salary']=[50000,60000,700000]
df

     Name  Age    City  Salary
0  Avnish   20  Kanpur   50000
1   Rohit   20  Ballia   60000
2   Ayush   19  Kanpur  700000

In [17]:
#3 Remove a column
df.drop("Salary",axis=1) ## This is not  is parmament operation temprary operation

## if axis =1 dege to column se hatayega if axis =1 nhi dege to row se hatayega

     Name  Age    City
0  Avnish   20  Kanpur
1   Rohit   20  Ballia
2   Ayush   19  Kanpur

In [18]:
df

     Name  Age    City  Salary
0  Avnish   20  Kanpur   50000
1   Rohit   20  Ballia   60000
2   Ayush   19  Kanpur  700000

In [19]:
## Add age to column

df['Age']=df['Age']+1
df

     Name  Age    City  Salary
0  Avnish   21  Kanpur   50000
1   Rohit   21  Ballia   60000
2   Ayush   20  Kanpur  700000

In [20]:
df.drop(0) ## Not a parmament operation

    Name  Age    City  Salary
1  Rohit   21  Ballia   60000
2  Ayush   20  Kanpur  700000

In [21]:
df

     Name  Age    City  Salary
0  Avnish   21  Kanpur   50000
1   Rohit   21  Ballia   60000
2   Ayush   20  Kanpur  700000

In [22]:
## Display the data types of each column
print("Data types:\n",df.dtypes)

## Describe the dataFrame
print("Statistical summary:\n",df.describe())

Data types:
 Name      object
Age        int64
City      object
Salary     int64
dtype: object
Statistical summary:
              Age         Salary
count   3.000000       3.000000
mean   20.666667  270000.000000
std     0.577350  372424.488991
min    20.000000   50000.000000
25%    20.500000   55000.000000
50%    21.000000   60000.000000
75%    21.000000  380000.000000
max    21.000000  700000.000000

In [23]:
df.describe()

             Age         Salary
count   3.000000       3.000000
mean   20.666667  270000.000000
std     0.577350  372424.488991
min    20.000000   50000.000000
25%    20.500000   55000.000000
50%    21.000000   60000.000000
75%    21.000000  380000.000000
max    21.000000  700000.000000

In [24]:
import numpy as np 
ser=pd.Series(np.random.rand(34))
ser

0     0.167604
1     0.462076
2     0.983289
3     0.450153
4     0.942609
5     0.186726
6     0.527495
7     0.705488
8     0.916995
9     0.784338
10    0.368833
11    0.491720
12    0.066854
13    0.334781
14    0.102525
15    0.142156
16    0.838264
17    0.909685
18    0.482294
19    0.316565
20    0.342795
21    0.005839
22    0.331163
23    0.768676
24    0.057625
25    0.008593
26    0.783897
27    0.840557
28    0.815603
29    0.161231
30    0.179194
31    0.458447
32    0.845926
33    0.281261
dtype: float64

In [25]:
type(ser)

pandas.core.series.Series

In [26]:
newdf=pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [27]:
newdf

            0         1         2         3         4
0    0.315054  0.650451  0.420609  0.248831  0.723278
1    0.670509  0.237673  0.138006  0.771767  0.730309
2    0.210786  0.739754  0.816646  0.376033  0.585637
3    0.904196  0.295909  0.144130  0.584060  0.377542
4    0.699836  0.186090  0.318860  0.328600  0.692568
..        ...       ...       ...       ...       ...
329  0.041918  0.948901  0.568556  0.473517  0.142385
330  0.938895  0.798438  0.245090  0.145636  0.964840
331  0.300387  0.987937  0.194720  0.754931  0.027644
332  0.118361  0.862492  0.462063  0.266008  0.146860
333  0.848951  0.185308  0.069455  0.409699  0.100131

[334 rows x 5 columns]

In [28]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.531182    0.517322    0.497297    0.505728    0.504357
std      0.295281    0.293325    0.293180    0.291224    0.299097
min      0.001041    0.002929    0.000003    0.000395    0.010037
25%      0.294712    0.268286    0.235485    0.245214    0.234754
50%      0.562383    0.510473    0.497239    0.512552    0.510500
75%      0.781607    0.797811    0.732837    0.753709    0.763778
max      0.998447    0.997847    0.999016    0.999763    0.996007

In [29]:
newdf[0][0]='Avnish'
newdf

C:\Users\verma\AppData\Local\Temp\ipykernel_9604\1038126950.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]='Avnish'
C:\Users\verma\AppData\Local\Temp\ipykernel_9604\1038126950.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Avnish' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]='Avnish'

            0         1         2         3         4
0      Avnish  0.650451  0.420609  0.248831  0.723278
1    0.670509  0.237673  0.138006  0.771767  0.730309
2    0.210786  0.739754  0.816646  0.376033  0.585637
3    0.904196  0.295909  0.144130  0.584060  0.377542
4    0.699836  0.186090  0.318860  0.328600  0.692568
..        ...       ...       ...       ...       ...
329  0.041918  0.948901  0.568556  0.473517  0.142385
330  0.938895  0.798438  0.245090  0.145636  0.964840
331  0.300387  0.987937  0.194720  0.754931  0.027644
332  0.118361  0.862492  0.462063  0.266008  0.146860
333  0.848951  0.185308  0.069455  0.409699  0.100131

[334 rows x 5 columns]

In [30]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [31]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [32]:
newdf.to_numpy() ## newdf is convert into numpy
## create a numpy array

array([['Avnish', 0.6504507145330642, 0.4206089464444841,
        0.24883050408334673, 0.7232781254679937],
       [0.6705094594989045, 0.23767335783367172, 0.13800621456353657,
        0.7717672635439672, 0.7303090931897286],
       [0.21078630771445994, 0.7397544122890284, 0.816646148605092,
        0.3760334951855072, 0.5856374175370485],
       ...,
       [0.30038657211045205, 0.9879374248472056, 0.19472006829380029,
        0.7549313927330371, 0.027644087650333438],
       [0.11836114257462538, 0.8624922068844024, 0.4620628356449682,
        0.26600833565418935, 0.14686041490400625],
       [0.8489513948304557, 0.18530834196944634, 0.0694553797876305,
        0.4096991830389677, 0.10013089552966459]],
      shape=(334, 5), dtype=object)

In [33]:
newdf[0][0]=0.3
newdf.head(5)

          0         1         2         3         4
0       0.3  0.650451  0.420609  0.248831  0.723278
1  0.670509  0.237673  0.138006  0.771767  0.730309
2  0.210786  0.739754  0.816646  0.376033  0.585637
3  0.904196  0.295909  0.144130  0.584060  0.377542
4  0.699836  0.186090  0.318860  0.328600  0.692568

In [34]:
newdf.T  ## Swap the row and columns

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.670509,0.210786,0.904196,0.699836,0.737012,0.275176,0.140908,0.539494,0.634154,...,0.823376,0.154022,0.78261,0.697284,0.537494,0.041918,0.938895,0.300387,0.118361,0.848951
1,0.650451,0.237673,0.739754,0.295909,0.18609,0.4183,0.497768,0.093167,0.154695,0.316523,...,0.595965,0.817805,0.284484,0.456886,0.279911,0.948901,0.798438,0.987937,0.862492,0.185308
2,0.420609,0.138006,0.816646,0.14413,0.31886,0.836077,0.320693,0.075751,0.775713,0.489829,...,0.246287,0.627851,0.22974,0.437847,0.955386,0.568556,0.24509,0.19472,0.462063,0.069455
3,0.248831,0.771767,0.376033,0.58406,0.3286,0.16067,0.772618,0.865453,0.198513,0.584752,...,0.110038,0.454395,0.322113,0.676163,0.673866,0.473517,0.145636,0.754931,0.266008,0.409699
4,0.723278,0.730309,0.585637,0.377542,0.692568,0.036059,0.875311,0.762489,0.902561,0.233297,...,0.254741,0.363089,0.820814,0.135434,0.890172,0.142385,0.96484,0.027644,0.14686,0.100131

In [35]:
newdf.head()

          0         1         2         3         4
0       0.3  0.650451  0.420609  0.248831  0.723278
1  0.670509  0.237673  0.138006  0.771767  0.730309
2  0.210786  0.739754  0.816646  0.376033  0.585637
3  0.904196  0.295909  0.144130  0.584060  0.377542
4  0.699836  0.186090  0.318860  0.328600  0.692568